<template>
  <div class="hello">
    <div>
      <div class="col-md-6">
        <div
          class="row no-gutters border rounded overflow-hidden flex-md-row mb-4 shadow-sm h-md-250 position-relative p-3"
        >
          <div class="col-auto d-none d-lg-block">
            <svg
              width="37"
              height="37"
              viewBox="0 0 37 37"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M8.6516 3.81078V13.4929C8.6516 14.7644 8.90203 16.0235 9.38861 17.1981C9.87518 18.3728 10.5884 19.4402 11.4874 20.3393C12.3865 21.2383 13.4539 21.9515 14.6286 22.4381C15.8033 22.9247 17.0623 23.1751 18.3338 23.1751C19.6052 23.1751 20.8643 22.9247 22.039 22.4381C23.2137 21.9515 24.281 21.2383 25.1801 20.3393C26.0792 19.4402 26.7923 18.3728 27.2789 17.1981C27.7655 16.0235 28.0159 14.7644 28.0159 13.4929V3.81078H8.6516ZM19.9481 26.3034V31.0423H25.1331V32.834H10.7998V31.0423H16.7195V26.3034C13.5997 25.9098 10.7309 24.3911 8.65134 22.0325C6.5718 19.6739 5.42451 16.6374 5.4248 13.4929V0.583984H31.2427V13.4929C31.243 16.6374 30.0957 19.6739 28.0162 22.0325C25.9366 24.3911 23.0678 25.9098 19.9481 26.3034ZM7.0391 34.4716H28.5391V36.2632H7.0391V34.4716Z"
                fill="#657E94"
              />
              <path
                d="M5.42458 7.04007H2.196V11.8812C2.196 13.9882 3.54333 15.7816 5.421 16.4463C6.49779 16.8709 7.03708 16.9623 7.03708 16.7204C7.03708 14.8732 6.49958 11.6447 5.42279 7.04007H5.42458ZM7.03708 18.3347C5.32563 18.3343 3.68441 17.6542 2.47423 16.444C1.26405 15.2338 0.583971 13.5926 0.583496 11.8812V5.42578H7.03887V18.3347H7.03708ZM31.2425 7.04007H34.4711V11.8812C34.4709 12.8825 34.1604 13.8592 33.5822 14.6768C33.004 15.4943 32.1866 16.1125 31.2425 16.4463C30.1675 16.8709 29.63 16.9623 29.63 16.7204C29.63 14.8732 30.1675 11.6447 31.2425 7.04007ZM29.63 18.3347C31.3414 18.3343 32.9827 17.6542 34.1928 16.444C35.403 15.2338 36.0831 13.5926 36.0836 11.8812V5.42578H29.63V18.3347Z"
                fill="#657E94"
              />
            </svg>
          </div>
          <div class="col p-4 d-flex flex-column position-static">
            <strong class="d-inline-block mb-2 text-primary">2 Круг ЮВ</strong>
            <h3 class="mb-0">🏆 Любительская Волебольная Лига</h3>
            <div class="mb-1 text-muted">создана 26.01.2020 20:51</div>
            <p class="card-text mb-auto">
              Вид спорта: Волейбол
            </p>
            <p class="card-text mb-auto">
              Команды: 10
            </p>
            <p class="card-text mb-auto">
              Дата проведения: 21.12.2020 02:00
            </p>
            <a href="#" class="stretched-link">Удалить Начать</a>
          </div>

          <div>
            <svg
              width="63"
              height="59"
              viewBox="0 0 63 59"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M23.669 37.277C27.1776 37.2841 29.2727 34.5142 29.2727 29.7415C29.2727 24.9972 27.1634 22.2557 23.669 22.2557C20.1747 22.2557 18.0724 24.9901 18.0653 29.7415C18.0653 34.5071 20.1605 37.277 23.669 37.277ZM23.669 35.054C21.858 35.054 20.7216 33.2358 20.7287 29.7415C20.7358 26.2756 21.8651 24.4503 23.669 24.4503C25.4801 24.4503 26.6094 26.2756 26.6165 29.7415C26.6165 33.2358 25.4872 35.054 23.669 35.054ZM39.4094 34.2727C39.4165 35.9631 40.489 37.4048 42.4847 37.4048C44.4734 37.4048 45.5671 35.9631 45.56 34.2727V33.5057C45.5671 31.8011 44.5018 30.3736 42.4847 30.3736C40.5174 30.3736 39.4165 31.8153 39.4094 33.5057V34.2727ZM32.016 25.9489C32.0231 27.6392 33.0955 29.0668 35.0984 29.0668C37.0799 29.0668 38.1737 27.6534 38.1665 25.9489V25.1818C38.1737 23.4773 37.1083 22.0497 35.0984 22.0497C33.1381 22.0497 32.0231 23.4773 32.016 25.1818V25.9489ZM32.6552 37H34.4379L44.4379 22.4545H42.6552L32.6552 37ZM41.2631 33.5057C41.2702 32.7528 41.5898 31.9929 42.4847 31.9929C43.4222 31.9929 43.6992 32.7528 43.6921 33.5057V34.2727C43.6992 35.0256 43.3938 35.7713 42.4847 35.7713C41.5756 35.7713 41.2702 35.0185 41.2631 34.2727V33.5057ZM33.8839 25.1818C33.891 24.4361 34.1964 23.669 35.0984 23.669C36.0359 23.669 36.3058 24.429 36.2987 25.1818V25.9489C36.3058 26.7017 36.0075 27.4474 35.0984 27.4474C34.1893 27.4474 33.891 26.7017 33.8839 25.9489V25.1818Z"
                fill="#657E94"
              />
              <path
                d="M58.5 29.5C58.5 44.9403 45.764 57.5 30 57.5C14.236 57.5 1.5 44.9403 1.5 29.5C1.5 14.0597 14.236 1.5 30 1.5C45.764 1.5 58.5 14.0597 58.5 29.5Z"
                stroke="#A9BBC9"
                stroke-opacity="0.2"
                stroke-width="3"
              />
            </svg>
          </div>
        </div>
      </div>
    </div>
    <h1>{{ msg }}</h1>
    <p>
      Создать свой турнир
      <a href="https://cli.vuejs.org" target="_blank" rel="noopener">здесь</a>.
    </p>
    <h3>Стартовый комплект</h3>
    <ul>
      <li>
        <a href="#" target="_blank" rel="noopener">Аккредитация для бизнеса</a>
      </li>
      <li>
        <a href="#" target="_blank" rel="noopener">Помочь с выбором турнира</a>
      </li>
      <li>
        <a href="#" target="_blank" rel="noopener">Помочь с выбором Тренера</a>
      </li>
    </ul>
    <h3>Новое</h3>
    <ul>
      <li>
        <a href="#" target="_blank" rel="noopener">Игровая практика</a>
      </li>
      <li>
        <a href="#" target="_blank" rel="noopener">Найти себе команду</a>
      </li>
      <li>
        <a href="#" target="_blank" rel="noopener">Добавить</a>
      </li>
    </ul>
    <h3>Заслуживающее внимания</h3>
    <ul>
      <li>
        <a href="#" target="_blank" rel="noopener">Поиграть самому</a>
      </li>
      <li>
        <a href="#" target="_blank" rel="noopener">Поиграть с командой</a>
      </li>
      <li>
        <a href="#" target="_blank" rel="noopener">Поиграть с друзьями</a>
      </li>
    </ul>
  </div>
</template>

<script>
export default {
  name: 'TournamentCard',
  props: {
    msg: String,
    // eslint-disable-next-line vue/require-prop-type-constructor
    required: true
  }
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped lang="scss">
h3 {
  margin: 40px 0 0;
}
ul {
  list-style-type: none;
  padding: 0;
}
li {
  display: inline-block;
  margin: 0 10px;
}
a {
  color: #42b983;
}
</style>
